qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV8 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV8 not defined"
#endif
#if !((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) ||               \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIK_SRCDIV value specified"
#endif

#if !defined(RCC_CFGR1_STOPWUCK_MSIS) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPWUCK_MSIS not defined"
#endif
#if !defined(RCC_CFGR1_STOPWUCK_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPWUCK_HSI16 not defined"
#endif
#if !((STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_MSIS) ||                    \
     (STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_HSI16)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPWUCK value specified"
#endif

#if !defined(RCC_CFGR1_STOPKERWUCK_MSIK) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPKERWUCK_MSIK not defined"
#endif
#if !defined(RCC_CFGR1_STOPKERWUCK_HSI16) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_STOPKERWUCK_HSI16 not defined"
#endif
#if !((STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_MSIK) ||              \
     (STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_HSI16)) &&             \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPKERWUCK value specified"
#endif

#if !defined(RCC_ICSCR1_MSIBIAS_CONTINUOUS) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_CONTINUOUS not defined"
#endif
#if !defined(RCC_ICSCR1_MSIBIAS_SAMPLING) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIBIAS_SAMPLING not defined"
#endif
#if !((STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_CONTINUOUS) ||               \
     (STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_SAMPLING)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIBIAS value specified"
#endif

#if !defined(RCC_CCIPR1_TIMICSEL_NOCLOCK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_NOCLOCK not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4 not defined"
#endif
#if !defined(RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4 not defined"
#endif
#if !((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) ||                \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4)) &&  \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_TIMICSEL value specified"
#endif

#if !((STM32_CFG_DAC1SH_REQUIRED == TRUE) ||                                \
     (STM32_CFG_DAC1SH_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_DAC1SH_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM1_REQUIRED == TRUE) ||                                \
     (STM32_CFG_LPTIM1_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM1_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM2_REQUIRED == TRUE) ||                                \
     (STM32_CFG_LPTIM2_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM2_REQUIRED value specified"
#endif

#if !((STM32_CFG_LPTIM34_REQUIRED == TRUE) ||                               \
     (STM32_CFG_LPTIM34_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM34_REQUIRED value specified"
#endif

#if !((STM32_CFG_OCTOSPI_REQUIRED == TRUE) ||                               \
     (STM32_CFG_OCTOSPI_REQUIRED == FALSE)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_OCTOSPI_REQUIRED value specified"
#endif

#if !((STM32_CFG_I3C1_REQUIRED == TRUE) || (STM32_CFG_I3C1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I3C1_REQUIRED value specified"
#endif

#if !((STM32_CFG_I3C2_REQUIRED == TRUE) || (STM32_CFG_I3C2_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I3C2_REQUIRED value specified"
#endif

#if !((STM32_CFG_SAI1_REQUIRED == TRUE) || (STM32_CFG_SAI1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI1_REQUIRED value specified"
#endif

#if !((STM32_CFG_ADF1_REQUIRED == TRUE) || (STM32_CFG_ADF1_REQUIRED == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADF1_REQUIRED value specified"
#endif

/**
 * @name    Frequency limits for vos1 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#else
#define STM32_VOS1_HSECLK_MIN               4000000
#define STM32_VOS1_HSECLK_MAX               50000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_LSECLK_MIN               5000
#define STM32_VOS1_LSECLK_MAX               40000
#else
#define STM32_VOS1_LSECLK_MIN               32768
#define STM32_VOS1_LSECLK_MAX               32768
#endif
#define STM32_VOS1_SYSCLK_MAX               96010000
#define STM32_VOS1_HCLK_MAX                 96010000
#define STM32_VOS1_PCLK1_MAX                96010000
#define STM32_VOS1_PCLK2_MAX                96010000
#define STM32_VOS1_PCLK3_MAX                96010000
#define STM32_VOS1_ADCCLK_MAX               55000000
#define STM32_VOS1_USBCLK_MIN               47880000
#define STM32_VOS1_USBCLK_MAX               48120000
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_0WS_MAX            32005000
#else
#define STM32_VOS1_FLASH_0WS_MAX            20000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_1WS_MAX            64007500
#else
#define STM32_VOS1_FLASH_1WS_MAX            40000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_2WS_MAX            96010000
#else
#define STM32_VOS1_FLASH_2WS_MAX            60000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_3WS_MAX            0
#else
#define STM32_VOS1_FLASH_3WS_MAX            80000000
#endif
#if ((STM32_FLASH_ACR & FLASH_ACR_LPM) == 0) || \
    defined(__DOXYGEN__)
#define STM32_VOS1_FLASH_4WS_MAX            0
#else
#define STM32_VOS1_FLASH_4WS_MAX            96010000
#endif
/** @} */

/**
 * @name    Frequency limits for vos2 state
 * @{
 */
#if defined(STM32_HSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               48000000
#else
#define STM32_VOS2_HSECLK_MIN               4000000
#define STM32_VOS2_HSECLK_MAX               48000000
#endif
#if defined(STM32_LSE_BYPASS) || \
    defined(__DOXYGEN__)
#define STM32_VOS2_LSECLK_MIN               5000
#define STM32_VOS2_LSECLK_MAX               40000
#else
#define STM32_VOS2_LSECLK_MIN               32768
#define STM32_VOS2_LSECLK_MAX               32768
#endif
#define STM32_VOS2_SYSCLK_MAX               48005000
#define STM32_VOS2_HCLK_MAX                 48005000
#define STM32_VOS2_PCLK1_MAX                48005000
#define STM32_VOS2_PCLK2_MAX                48005000
#define STM32_VOS2_PCLK3_MAX                48005000
#define STM32_VOS2_ADCCLK_MAX               48005000
#define STM32_VOS2_USBCLK_MIN               47880000
#define STM32_VOS2_USBCLK_MAX               48120000
#define STM32_VOS2_FLASH_0WS_MAX            16001250
#define STM32_VOS2_FLASH_1WS_MAX            32002500
#define STM32_VOS2_FLASH_2WS_MAX            48005000
#define STM32_VOS2_FLASH_3WS_MAX            0
#define STM32_VOS2_FLASH_4WS_MAX            0
/** @} */

