qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
     ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_LSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE))
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICSCR1_MSIRC1_BITS        (RCC_ICSCR1_MSIPLL1SEL_HSE |    \
                                             RCC_ICSCR1_MSIPLL1N_FIELD(STM32_CFG_MSIPLL1N_VALUE) | \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_ICSCR1_MSIRC1_BITS        0U
  #endif
#else
  #define STM32_ICSCR1_MSIRC1_BITS          0U
#endif

/**
 * @brief   MSI 24MHz internal oscillator clock point.
 */
#if (STM32_MSIRC1_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_MSIRC1_FREQ                 0U
#elif ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))) || \
    defined(__DOXYGEN__)
  #define STM32_MSIRC1_FREQ                 23986000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #define STM32_MSIRC1_FREQ                 22577000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #define STM32_MSIRC1_FREQ                 24576000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE)
  #define STM32_MSIRC1_FREQ                 24000000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #define STM32_MSIRC1_FREQ                 24016000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #define STM32_MSIRC1_FREQ                 22581000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #define STM32_MSIRC1_FREQ                 24577000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE)
  #define STM32_MSIRC1_FREQ                 24000000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #define STM32_MSIRC1_FREQ                 23986000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #define STM32_MSIRC1_FREQ                 22577000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #define STM32_MSIRC1_FREQ                 24576000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST)
  #define STM32_MSIRC1_FREQ                 24000000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #define STM32_MSIRC1_FREQ                 24016000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #define STM32_MSIRC1_FREQ                 22581000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #define STM32_MSIRC1_FREQ                 24577000U
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)
  #define STM32_MSIRC1_FREQ                 24000000U
#else
  #define STM32_MSIRC1_FREQ                 24000000U
#endif

/*--- Macros and checks for the MSIS clock point. --------------------------*/

/**
 * @brief   MSIS clock register bits.
 */
#if (STM32_MSIS_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_MSIS_BITS                RCC_CR_MSISON
#else
  #define STM32_CR_MSIS_BITS                0U
#endif

