qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the I2C2 clock point. --------------------------*/

/**
 * @brief   I2C2 clock register bits.
 */
#if (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C2_BITS                   RCC_CCIPR1_I2C2SEL_PCLK1
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #define STM32_I2C2_BITS                   RCC_CCIPR1_I2C2SEL_MSIK
#else
  #error "invalid STM32_CFG_I2C2_SEL value specified"
#endif

/**
 * @brief   I2C2 clock clock point.
 */
#if ((STM32_I2C2_ENABLED == TRUE) && \
     (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C2_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #define STM32_I2C2_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_I2C2_FREQ                   0U
#endif

/*--- Macros and checks for the I2C3 clock point. --------------------------*/

/**
 * @brief   I2C3 clock register bits.
 */
#if (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I2C3_BITS                   RCC_CCIPR3_I2C3SEL_PCLK3
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #define STM32_I2C3_BITS                   RCC_CCIPR3_I2C3SEL_MSIK
#else
  #error "invalid STM32_CFG_I2C3_SEL value specified"
#endif

/**
 * @brief   I2C3 clock clock point.
 */
#if ((STM32_I2C3_ENABLED == TRUE) && \
     (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C3_FREQ                   STM32_PCLK3_FREQ
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #define STM32_I2C3_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_I2C3_FREQ                   0U
#endif

/*--- Macros and checks for the I3C1 clock point. --------------------------*/

/**
 * @brief   I3C1 clock register bits.
 */
#if (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I3C1_BITS                   RCC_CCIPR1_I3C1SEL_PCLK1
#elif (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_MSIK)
  #define STM32_I3C1_BITS                   RCC_CCIPR1_I3C1SEL_MSIK
#else
  #error "invalid STM32_CFG_I3C1_SEL value specified"
#endif

/**
 * @brief   I3C1 clock clock point.
 */
#if ((STM32_I3C1_ENABLED == TRUE) && \
     (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I3C1_FREQ                   STM32_PCLK1_FREQ
#elif (STM32_I3C1_ENABLED == TRUE) && \
      (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_MSIK)
  #define STM32_I3C1_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_I3C1_FREQ                   0U
#endif

/*--- Macros and checks for the I3C2 clock point. --------------------------*/

/**
 * @brief   I3C2 clock register bits.
 */
#if (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_I3C2_BITS                   RCC_CCIPR1_I3C2SEL_PCLK2
#elif (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_MSIK)
  #define STM32_I3C2_BITS                   RCC_CCIPR1_I3C2SEL_MSIK
#else
  #error "invalid STM32_CFG_I3C2_SEL value specified"
#endif

/**
 * @brief   I3C2 clock clock point.
 */
#if ((STM32_I3C2_ENABLED == TRUE) && \
     (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_PCLK2)) || \
    defined(__DOXYGEN__)
  #define STM32_I3C2_FREQ                   STM32_PCLK2_FREQ
#elif (STM32_I3C2_ENABLED == TRUE) && \
      (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_MSIK)
  #define STM32_I3C2_FREQ                   STM32_MSIK_FREQ
#else
  #define STM32_I3C2_FREQ                   0U
#endif

/*--- Macros and checks for the ADCDACICLK clock point. --------------------*/

/**
 * @brief   ADCDACICLK clock register bits.
 */
#if (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_HCLK) ||              \
    defined(__DOXYGEN__)
  #define STM32_ADCDACICLK_BITS             RCC_CCIPR2_ADCDACSEL_HCLK
#elif (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_HSE)
  #define STM32_ADCDACICLK_BITS             RCC_CCIPR2_ADCDACSEL_HSE
#elif (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)
  #define STM32_ADCDACICLK_BITS             RCC_CCIPR2_ADCDACSEL_MSIK
#else
  #error "invalid STM32_CFG_ADCDACICLK_SEL value specified"
#endif

/**
 * @brief   ADC and DAC intermediate clock clock point.
 */
#if ((STM32_ADCDACICLK_ENABLED == TRUE) && \
     (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADCDACICLK_FREQ             STM32_HCLK_FREQ
#elif (STM32_ADCDACICLK_ENABLED == TRUE) && \
      (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_HSE)
  #define STM32_ADCDACICLK_FREQ             STM32_HSE_FREQ
#elif (STM32_ADCDACICLK_ENABLED == TRUE) && \
      (STM32_CFG_ADCDACICLK_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)
  #define STM32_ADCDACICLK_FREQ             STM32_MSIK_FREQ
#else
  #define STM32_ADCDACICLK_FREQ             0U
#endif

/*--- Macros and checks for the ADCDACPRE clock point. ---------------------*/

/**
 * @brief   ADCDACPRE clock register bits.
 */
#if (STM32_CFG_ADCDACPRE_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLK
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 2)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV2
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 4)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV4
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 8)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV8
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 16)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV16
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 32)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV32
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 64)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV64
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 128)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV128
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 256)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV256
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#elif (STM32_CFG_ADCDACPRE_VALUE == 512)
  #if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ADCDACPRE_BITS            RCC_CCIPR2_ADCDACPRE_ICLKDIV512
  #else
    #define STM32_ADCDACPRE_BITS            0U
  #endif
#else
  #error "invalid STM32_CFG_ADCDACPRE_VALUE value specified"
#endif

/**
 * @brief   ADC and DAC prescaled clock clock point.
 */
#if (STM32_ADCDACPRE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_ADCDACPRE_FREQ              (STM32_ADCDACICLK_FREQ /        \
                                             STM32_CFG_ADCDACPRE_VALUE)
#else
  #define STM32_ADCDACPRE_FREQ              0U
#endif

/*--- Macros and checks for the ADCDAC clock point. ------------------------*/

/**
 * @brief   ADCDAC clock register bits.
 */
#define STM32_ADCDAC_BITS                   0U

/**
 * @brief   ADC and DAC clock clock point.
 */
#if (STM32_ADCDAC_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_ADCDAC_FREQ                 STM32_ADCDACPRE_FREQ
#else
  #define STM32_ADCDAC_FREQ                 0U
#endif

