qmk/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*
 * Sink-specific frequency checks.
 */
#if !(!((HAL_USE_USB == TRUE) && (STM32_USB_USE_USB1 == TRUE)) ||           \
     (STM32_USB_FREQ >= STM32_USBCLK_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ below minimum frequency for USB1_DRIVER"
#endif

#if !(!((HAL_USE_USB == TRUE) && (STM32_USB_USE_USB1 == TRUE)) ||           \
     (STM32_USB_FREQ <= STM32_USBCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ above maximum frequency for USB1_DRIVER"
#endif
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @name    Current clock point values
 * @{
 */
#define STM32_NONE_CLOCK                    STM32_NONE_FREQ
#define STM32_AUDIOCLK_CLOCK                STM32_AUDIOCLK_FREQ
#define STM32_HSI16_CLOCK                   hal_lld_get_clock_point(CLK_HSI16)
#define STM32_HSI48_CLOCK                   hal_lld_get_clock_point(CLK_HSI48)
#define STM32_HSE_CLOCK                     hal_lld_get_clock_point(CLK_HSE)
#define STM32_LSE_CLOCK                     STM32_LSE_FREQ
#define STM32_LSI_CLOCK                     STM32_LSI_FREQ
#define STM32_MSIRC0_CLOCK                  STM32_MSIRC0_FREQ
#define STM32_MSIRC1_CLOCK                  STM32_MSIRC1_FREQ
#define STM32_MSIS_CLOCK                    hal_lld_get_clock_point(CLK_MSIS)
#define STM32_MSIK_CLOCK                    hal_lld_get_clock_point(CLK_MSIK)
#define STM32_SYSCLK_CLOCK                  hal_lld_get_clock_point(CLK_SYSCLK)
#define STM32_HCLK_CLOCK                    hal_lld_get_clock_point(CLK_HCLK)
#define STM32_PCLK1_CLOCK                   hal_lld_get_clock_point(CLK_PCLK1)
#define STM32_PCLK1TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK1TIM)
#define STM32_PCLK2_CLOCK                   hal_lld_get_clock_point(CLK_PCLK2)
#define STM32_PCLK2TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK2TIM)
#define STM32_PCLK3_CLOCK                   hal_lld_get_clock_point(CLK_PCLK3)
#define STM32_HSEDIV_CLOCK                  STM32_HSEDIV_FREQ
#define STM32_HCLKDIV8_CLOCK                STM32_HCLKDIV8_FREQ
#define STM32_MCO1DIV_CLOCK                 STM32_MCO1DIV_FREQ
#define STM32_MCO1_CLOCK                    hal_lld_get_clock_point(CLK_MCO1)
#define STM32_MCO2DIV_CLOCK                 STM32_MCO2DIV_FREQ
#define STM32_MCO2_CLOCK                    hal_lld_get_clock_point(CLK_MCO2)
#define STM32_RTC_CLOCK                     STM32_RTC_FREQ
#define STM32_LSCO_CLOCK                    STM32_LSCO_FREQ
#define STM32_USART1_CLOCK                  STM32_USART1_FREQ
#define STM32_USART3_CLOCK                  STM32_USART3_FREQ
#define STM32_UART4_CLOCK                   STM32_UART4_FREQ
#define STM32_UART5_CLOCK                   STM32_UART5_FREQ
#define STM32_LPUART1_CLOCK                 STM32_LPUART1_FREQ
#define STM32_LPTIM1_CLOCK                  STM32_LPTIM1_FREQ
#define STM32_LPTIM2_CLOCK                  STM32_LPTIM2_FREQ
#define STM32_LPTIM34_CLOCK                 STM32_LPTIM34_FREQ
#define STM32_SPI1_CLOCK                    STM32_SPI1_FREQ
#define STM32_SPI2_CLOCK                    STM32_SPI2_FREQ
#define STM32_SPI3_CLOCK                    STM32_SPI3_FREQ
#define STM32_OCTOSPI_CLOCK                 STM32_OCTOSPI_FREQ
#define STM32_SYSTICK_CLOCK                 STM32_SYSTICK_FREQ
#define STM32_TIM16IC_CLOCK                 STM32_TIM16IC_FREQ
#define STM32_TIM17IC_CLOCK                 STM32_TIM17IC_FREQ
#define STM32_LPTIM2IC_CLOCK                STM32_LPTIM2IC_FREQ
#define STM32_ICLK_CLOCK                    STM32_ICLK_FREQ
#define STM32_ICLKDIV2_CLOCK                STM32_ICLKDIV2_FREQ
#define STM32_USB_CLOCK                     STM32_USB_FREQ
#define STM32_SDMMC1_CLOCK                  STM32_SDMMC1_FREQ
#define STM32_I2C1_CLOCK                    STM32_I2C1_FREQ
#define STM32_I2C2_CLOCK                    STM32_I2C2_FREQ
#define STM32_I2C3_CLOCK                    STM32_I2C3_FREQ
#define STM32_I3C1_CLOCK                    STM32_I3C1_FREQ
#define STM32_I3C2_CLOCK                    STM32_I3C2_FREQ
#define STM32_ADCDACICLK_CLOCK              STM32_ADCDACICLK_FREQ
#define STM32_ADCDACPRE_CLOCK               STM32_ADCDACPRE_FREQ
#define STM32_ADCDAC_CLOCK                  STM32_ADCDAC_FREQ
#define STM32_DAC1SH_CLOCK                  STM32_DAC1SH_FREQ
#define STM32_RNG_CLOCK                     STM32_RNG_FREQ
#define STM32_FDCAN1_CLOCK                  STM32_FDCAN1_FREQ
#define STM32_SAI1_CLOCK                    STM32_SAI1_FREQ
#define STM32_ADF1_CLOCK                    STM32_ADF1_FREQ
/** @} */

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                 \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                 \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                 \
   (clkpt) == CLK_MSIS         ? STM32_MSIS_FREQ          :                 \
   (clkpt) == CLK_MSIK         ? STM32_MSIK_FREQ          :                 \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                 \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                 \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                 \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                 \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK3        ? STM32_PCLK3_FREQ         :                 \
   (clkpt) == CLK_MCO1         ? STM32_MCO1_FREQ          :                 \
   (clkpt) == CLK_MCO2         ? STM32_MCO2_FREQ          :                 \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
